# Taps
# ----------------------------------------------------------
tap "homebrew/cask-versions"
tap "FelixKratz/formulae"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "buo/cask-upgrade"
tap "homebrew/bundle"

# Formula
# ----------------------------------------------------------
brew "neovim"
brew "powershell/tap/powershell"
brew "python3"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Casks
# ----------------------------------------------------------
# Browsers
cask "firefox"
cask "google-chrome"
cask "microsoft-edge"
cask "tor-browser"

# Common Apps
cask "discord"
cask "iterm2"
cask "obs"
cask "obsidian"
cask "sublime-text"
cask "visual-studio-code"
cask "vlc"

# LLM
cask "ollama"

# Me Specific
cask "elgato-stream-deck"
cask "focusrite-control"
cask "logi-options+"
cask "reaper"

# Visual Studio Code Extensions
# ----------------------------------------------------------
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.vscode-xml"

# Mas (app store applications)
# ----------------------------------------------------------